#include <iostream>
#include <functions.hpp>

// окчяш дбсябъгмнцн яохяйю : кецйне х ашярпне люмхоскхпнбюмхе я йнк-бнл щкелемрнб
// + сксвьемн ашярпндеиярбхе я днаюбкемхел сдюкемхел + сксвьемн ашярпндеиярбхе днярсою й йнмйпермнлс щкелемрс
// - ашярпндеиярбхе ябндхряъ й 0 акхфе й яепедхме яохяйю
// - он нрмньемхч й ндмнябъгмнлс яохяйс пюгмше люухмюжхх я дбсябъгмшл рпеасчр анкэье ноепюжхи (хг-гю 2у онкеи)
// - дкъ ярейю аеяонкегмши (кхьмее)
// лхмсяш: ашярпндеиярбхе й онксвемхч днярсою й йнмйпермнлс щкелемрс

using namespace fal;

int main()
{
	DLCL list;

	int a[3] = { 2, 5, 128 };
	
	for (int i = 0; i < 3; i++)
	{
		if (a[i] % 2 == 0)
			list.ADDINHEAD(a[i]);
		else
			list.ADDINTAIL(a[i]);

	}

	//list.PRINT();
	std::cout << std::endl;

	//list.INSERT(1, 10);
	//list.DELETE(2);
	list.PRINT();
	std::cout << std::endl;
	list.REVERSEPRINT();

	return 0;

}